In [3]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable<1 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.4.27)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)

In [4]:
!pip install mysql

Requirement already satisfied: mysql in c:\programdata\anaconda3\lib\site-packages (0.0.3)
Requirement already satisfied: mysqlclient in c:\programdata\anaconda3\lib\site-packages (from mysql) (2.1.0)

In [ ]:
<style type="text/css">
.rendered_html code  {
   background-color:#E8E8E8;
   padding: 3px;
};
</style>
<p>test</p>

<hr>
Use the <b>sqlalchemy</b> library to create an engine needed to connect to the database. 
<br><br>
This will be required only once per connection string — meaning you won’t have to do it each 
time when making a connection.
<br><br>
Here are some general-looking connection strings for various databases:
<br><br>
PostgreSQL: postgresql://scott:password@localhost/dbname<br>
MySQL: mysql://scott:password@localhost/dbname<br>
Oracle: oracle://scott:password@127.0.0.1:1521/sidname<br>
SQL Server: mssql+pyodbc://scott:password@mydsn<br>
SQLite: sqlite:///foo.db<br>
<hr>

In [16]:
import sqlalchemy

In [17]:
db = sqlalchemy.create_engine('mysql://root:YOURPASSWORD@localhost:3306/classicmodels')

<hr>
Load in the SQL module previously installed above.<br><br>
Use reload if need to reload
<hr>

In [5]:
%load_ext sql

#%reload_ext sql

Connect to the MySQL database with a connection string specified earlier. Notice how the column content is prefixed with the percent sign.

In [18]:
%sql mysql://root:YOURPASSWORD@localhost:3306/classicmodels

<b>Mark entire cell as a SQL block.  Use %%sql with a double percent sign.</b>

In [20]:
%%sql
SELECT * from customers LIMIT 5;

 * mysql://root:***@localhost:3306/classicmodels
5 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00')),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, Decimal('71800.00')),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, Decimal('117300.00')),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, Decimal('118200.00')),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 'Norway', 1504, Decimal('81700.00'))]

<b>Single Line Statements — Store result to a Variable.  Use %sql with a single percent sign.</b>

In [21]:
# for below, using double quotes instead of single quotes results in an error
x = %sql SELECT phone FROM customers WHERE customerName = 'La Rochelle Gifts';
print(x)
type(x)
print()
print(x[0])   # it's a typle

 * mysql://root:***@localhost:3306/classicmodels
1 rows affected.
+------------+
|   phone    |
+------------+
| 40.67.8555 |
+------------+

('40.67.8555',)

In [11]:
import pandas

result = %sql SELECT * FROM customers;

df = result.DataFrame()
print(df)

 * mysql://root:***@localhost:3306/classicmodels
122 rows affected.
     customerNumber                    customerName contactLastName  \
0               103               Atelier graphique         Schmitt
1               112              Signal Gift Stores            King
2               114      Australian Collectors, Co.        Ferguson
3               119               La Rochelle Gifts         Labrune
4               121              Baane Mini Imports      Bergulfsen
..              ...                             ...             ...
117             486    Motor Mint Distributors Inc.         Salazar
118             487        Signal Collectibles Ltd.          Taylor
119             489  Double Decker Gift Stores, Ltd           Smith
120             495            Diecast Collectables          Franco
121             496               Kelly's Gift Shop         Snowden

    contactFirstName           phone                  addressLine1  \
0            Carine       40.32.2555                54, rue Royale
1               Jean      7025551838               8489 Strong St.
2              Peter    03 9520 4555             636 St Kilda Road
3            Janine       40.67.8555  67, rue des Cinquante Otages
4             Jonas       07-98 9555        Erling Skakkes gate 78
..               ...             ...                           ...
117             Rosa      2155559857             11328 Douglas Av.
118              Sue      4155554312             2793 Furth Circle
119          Thomas   (171) 555-7555               120 Hanover Sq.
120          Valarie      6175552555                6251 Ingle Ln.
121             Tony   +64 9 5555500            Arenales 1938 3'A'

    addressLine2          city     state postalCode      country  \
0           None        Nantes      None      44000       France
1           None     Las Vegas        NV      83030          USA
2        Level 3     Melbourne  Victoria       3004    Australia
3           None        Nantes      None      44000       France
4           None       Stavern      None       4110       Norway
..           ...           ...       ...        ...          ...
117         None  Philadelphia        PA      71270          USA
118         None      Brisbane        CA      94217          USA
119         None        London      None    WA1 1DP           UK
120         None        Boston        MA      51003          USA
121         None    Auckland        None       None  New Zealand

     salesRepEmployeeNumber creditLimit
0                    1370.0    21000.00
1                    1166.0    71800.00
2                    1611.0   117300.00
3                    1370.0   118200.00
4                    1504.0    81700.00
..                      ...         ...
117                  1323.0    72600.00
118                  1165.0    60300.00
119                  1501.0    43300.00
120                  1188.0    85100.00
121                  1612.0   110000.00

[122 rows x 13 columns]

In [22]:
print(type(df))
df.head()

<class 'pandas.core.frame.DataFrame'>

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.00

In [23]:
db.dispose()